"use client";
import { Button, Checkbox } from "antd";
import { CheckboxChangeEvent } from "antd/es/checkbox";
import { useRouter } from "next/navigation";
import { useEffect, useState } from "react";

export default function LinePage() {
  const router = useRouter();
  const [isChecked, setIsChecked] = useState(false);
  const [isScrolledToBottom, setIsScrolledToBottom] = useState(false);

  useEffect(() => {
    const onScroll = () => {
      if (window.innerHeight + window.scrollY >= document.body.offsetHeight) {
        setIsScrolledToBottom(true);
      }
    };

    // เพิ่ม event listener
    window.addEventListener("scroll", onScroll);
    return () => {
      // ลบ event listener เมื่อ component ถูก unmount
      window.removeEventListener("scroll", onScroll);
    };
  }, []);

  const onChange = (event: CheckboxChangeEvent) => {
    setIsChecked(event.target.checked);
  };

  const handleRegisterClick = () => {
    if (isChecked) {
      // router.push("/register");
      location.href = "/register";
    }
  };

  return (
    <div className="relative flex flex-col h-screen bg-white min-h-max">
      <div className="fixed top-0 z-10 w-full h-[100px] border-b-[20px] border-white bg-rainbow">
        <div className="flex items-center justify-center h-full container__custom max-[470px]:px-5">
          <h1 className="text-2xl font-normal text-center text-white">
            เงื่อนไขและข้อตกลง
          </h1>
        </div>
      </div>
      <div className="pt-24 container__custom grow max-[470px]:px-5">
        การเข้าเว็บไซต์นี้ ตลอดจนการเปิดหน้าเว็บต่าง ๆ ที่อยู่ในเว็บไซต์นี้
        ผู้ใช้งานเว็บไซต์ ตกลงและยินยอมที่จะ ปฏิบัติตามนโยบายของบริษัท
        กฎหมายที่ใช้บังคับ และ ข้อตกลงและเงื่อนไขการใช้งานเว็บไซต์ที่กำหนดไว้ใน
        ข้อตกลงนี้ทั้งที่กำหนดไว้เป็นการทั่วไปและที่ได้กำหนดไว้โดยเฉพาะเจาะจงในส่วนใดส่วนหนึ่งของเว็บไซต์นี้ทั้งหมด
        (“ข้อตกลงและเงื่อนไขการใช้”) โดยผู้ใช้งาน
        รับทราบและตกลงว่าข้อตกลงและเงื่อนไขการใช้ที่กำหนดไว้นั้นอาจมีการเปลี่ยนแปลงได้โดยไม่ต้องมีการบอก
        กล่าวล่วงหน้า อย่างไรก็ดี การเปลี่ยนแปลงใด ๆ ที่เกี่ยวกับข้อตกลง
        และเงื่อนไขการใช้จะมีการเผยแพร่ไว้ในเว็บไซต์นี้ และ
        เมื่อผู้ใช้งานได้เข้าใช้งานเว็บไซต์นี้ภายหลังการเปลี่ยนแปลงดังกล่าวแล้ว
        ย่อมถือว่าผู้ใช้งานตกลงยอมรับ
        ข้อตกลงและเงื่อนไขการใช้ทั้งหมดตามที่ได้เปลี่ยนแปลงแล้ว ดังนั้น
        ผู้ใช้งานจึงควรติดตามข้อตกลงและเงื่อนไข
        การใช้งานเว็บไซต์ที่กำหนดไว้นี้อยู่เสมอ ทั้งนี้
        หากท่านไม่เห็นด้วยหรือประสงค์ที่จะปฏิเสธ ความมี
        ผลผูกพันตามข้อตกลงและเงื่อนไขการใช้ใด ๆ
        ขอความกรุณาท่านยุติการเข้าชมและใช้งานเว็บไซต์นี้ 1.
        การใช้เว็บไซต์และทรัพย์สินทางปัญญา 1.1
        บรรดาข้อมูลที่ปรากฏในเว็บไซต์นี้ซึ่งรวมถึงแต่ไม่ จำกัดเฉพาะ ข้อความ
        รูปภาพ ตารางข้อมูล กราฟ ราคา หรือมูลค่าหลักทรัพย์ (ถ้ามี)
        เครื่องหมายการค้า กราฟิกต่าง ๆ เสียง การออกแบบหน้าจอแอปพลิเคชัน
        การออกแบบส่วนต่อประสานกับผู้ใช้ (Interface) ข้อมูลต่าง ๆ
        ไม่ว่าจะอยู่ในรูปแบบใด โปรแกรมซอฟท์แวร์ใด ๆ ที่มีอยู่ในเว็บไซต์นี้
        รวมถึงข้อมูลทั้งหลายที่ผู้ใช้งานได้ดาวน์โหลดจากเว็บไซต์นี้
        (ซึ่งต่อไปนี้จะรวมเรียกว่า “เนื้อหา”) ถือเป็นสิทธิของออนไลน์ แอสเซ็ท
        หรือผู้ให้อนุญาตแก่ออนไลน์ แอสเซ็ท
        ซึ่งเนื้อหาเหล่านั้นได้รับความคุ้มครองด้านทรัพย์สินทางปัญญา
        และ/หรือสิทธิในความเป็นเจ้าของอื่น ๆ
        ตามกฎหมายของประเทศไทยและ/หรือกฎหมายของประเทศอื่นไม่ว่าในรูปแบบใด ๆ
        และไม่ว่าจะได้รับการจดทะเบียนไว้แล้วหรือไม่ก็ตาม ทั้งนี้
        การนำชื่อทางการค้า เครื่องหมายการค้า เครื่องหมายบริการ
        และเครื่องหมายอื่น ๆ ของออนไลน์ แอสเซ็ท รวมถึงทรัพย์สินทางปัญญาใด ๆ
        ที่ปรากฏในเว็บไซต์นี้ไปใช้ ไม่ว่าจะด้วยวัตถุประสงค์ใด ๆ
        ผู้ใช้งานจะต้องได้รับความยินยอมล่วงหน้าเป็นลายลักษณ์อักษรจากออนไลน์
        แอสเซ็ท ก่อนดำเนินการ 1.2 บรรดาชื่อทางการค้า ชื่อสินค้า
        เครื่องหมายการค้า เครื่องหมายบริการ และเครื่องหมายอื่น ๆ
        รวมถึงทรัพย์สินทางปัญญาอื่นใดที่ปรากฏในเว็บไซต์นี้
        นอกเหนือจากสิ่งที่เป็นทรัพย์สินทางปัญญาของออนไลน์ แอสเซ็ท
        ซึ่งได้ถูกนำมาเรียบเรียงหรือจัดให้มีขึ้นเพื่อใช้เป็นส่วนประกอบของเว็บไซต์นี้
        มีขึ้นเพื่อวัตถุประสงค์ในการตกแต่งรูปลักษณ์ของเว็บไซต์ โดยออนไลน์
        แอสเซ็ทในฐานะผู้ให้บริการเว็บไซต์ไม่ได้มีเจตนาที่จะกระทำการใด ๆ
        อันเป็นการละเมิดสิทธิในทางการค้าหรือทรัพย์สินทางปัญญาของผู้ใด
        เว้นแต่มีข้อความระบุไว้เป็นอย่างอื่นในเว็บไซต์นี้ 1.3 บรรดาเนื้อหา ไฟล์
        หรือเอกสารที่ปรากฏในเว็บไซต์นี้ ผู้ใช้งานมีสิทธิเพียงเข้าดู ดาวน์โหลด
        อัพโหลดเนื้อหา และพิมพ์เนื้อหาดังกล่าว
        เฉพาะเพื่อประโยชน์แก่การใช้งานในทางส่วนตัวและต้องไม่ใช่การใช้งานที่เป็นไปเพื่อประโยชน์ในทางการค้า
        และผู้ใช้งานตกลงไม่ทำสำเนา หรือจัดเก็บ
        หรือดาวน์โหลดเนื้อหาไม่ว่าจะในรูปของเอกสารหรือในรูปแบบสื่ออิเล็กทรอนิกส์อื่นใดอันมีวัตถุประสงค์เพื่อการส่ง
        โอน จัดทำ เผยแพร่ พิมพ์ ทำซ้ำ ดัดแปลง สร้างงานที่พัฒนา นำออกแสดง
        แพร่กระจาย จำหน่าย ให้สิทธิ เช่า ให้เช่า หรือโอนเนื้อหาใด ๆ
        ให้แก่บุคคลภายนอก
        ไม่ว่าการกระทำดังกล่าวจะเป็นไปเพื่อประโยชน์ในทางการค้าหรือได้รับประโยชน์เป็นสิ่งตอบแทนอื่นใดหรือไม่ก็ตาม
        เว้นแต่จะได้รับความยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจากออนไลน์
        แอสเซ็ทก่อนดำเนินการ 2. ข้อสงวนสิทธิ์และข้อจำกัดความรับผิด 2.1
        เว็บไซต์นี้มีขึ้นเพื่อวัตถุประสงค์ในการให้ข้อมูลข่าวสารเกี่ยวกับการเงิน
        - การลงทุนเท่านั้น ดังนั้น บรรดาข้อมูลต่างๆ ที่เผยแพร่บนเว็บไซต์นี้
        (ซึ่งต่อไปนี้จะรวมเรียกว่า “บรรดาข้อมูลที่เผยแพร่”)
        จึงเป็นข้อมูลที่ผู้ใช้งานสามารถพบเห็นได้เป็นการทั่วไป
        และไม่ให้ถือว่าบรรดาข้อมูลที่เผยแพร่นั้นเป็นการให้คำแนะนำหรือให้ความเห็นในทางกฎหมาย
        และไม่ให้ถือว่าเป็นการให้คำแนะนำเกี่ยวกับการซื้อขายหรือการลงทุนในหลักทรัพย์ใด
        ๆ ที่ปรากฏในเว็บไซต์นี้
        ในการตัดสินใจลงทุนผู้ใช้งานควรศึกษาข้อมูลเพิ่มเติมเกี่ยวกับรายละเอียดหลักทรัพย์
        บริษัทผู้ออกหลักทรัพย์ รวมถึงการประเมินความเสี่ยงที่สามารถยอมรับได้
        โดยผู้ใช้งานควรขอรับคำปรึกษาในเรื่องการประเมินหลักทรัพย์
        รายงานดัชนีหลักทรัพย์ ความคิดเห็น คำปรึกษา
        หรือข้อมูลอื่นใดเพิ่มเติมจากบุคคลผู้ประกอบวิชาชีพที่เกี่ยวข้อง
        ตลอดจนปฏิบัติตามประกาศ ข้อบังคับ
        และกฎเกณฑ์ของหน่วยงานกำกับดูแลที่เกี่ยวข้อง รวมถึงระเบียบต่าง ๆ
        ในการเข้าใช้งานเว็บไซต์นี้ 2.2
        เนื้อหาที่แสดงบนเว็บไซต์นี้ถูกนำเสนอตามสภาพที่ได้รับ (“as is” basis)
        โดยออนไลน์ แอสเซ็ทไม่อาจรับรองหรือรับประกันใด ๆ
        ไม่ว่าทางตรงหรือทางอ้อมในเรื่องใด
        ไม่ว่าจะเป็นการรับประกันด้านความครบถ้วน ถูกต้องเหมาะสม ความเป็นปัจจุบัน
        หรือความน่าเชื่อถือของเนื้อหาและข้อมูล
        หรือการรับประกันผลที่จะได้รับจากการใช้เนื้อหาหรือการใช้เว็บไซต์นี้
        รวมถึงความเหมาะสมในการใช้งาน และออนไลน์
        แอสเซ็ทไม่ต้องรับผิดชอบในความสูญหาย หรือความเสียหายใด ๆ
        รวมถึงไม่รับผิดชอบต่อผลกำไรหรือขาดทุนที่เกิดการใช้เว็บไซต์และ/หรือจากการนำเนื้อหาข้อมูลที่ปรากฏในเว็บไซต์นี้ไปใช้ในทุกกรณี
        2.3 ออนไลน์
        แอสเซ็ทจะดำเนินการอย่างเหมาะสมเพื่อให้การเข้าถึงและการใช้งานเว็บไซต์นี้เป็นไปอย่างต่อเนื่อง
        ไม่หยุดชะงัก และจะจัดให้มีระบบป้องกันการเข้าถึงข้อมูลใด ๆ
        จากบุคคลที่ไม่ใช่ผู้ใช้งานหรือสมาชิก efinancethai Member ของเว็บไซต์นี้
        อย่างไรก็ดี ออนไลน์
        แอสเซ็ทไม่อาจรับรองได้ว่าการเข้าใช้งานเว็บไซต์จะเป็นไปโดยปราศจากความล่าช้าและข้อผิดพลาดใด
        ๆ และไม่อาจรับรองว่าเว็บไซต์นี้จะปราศจากโปรแกรม ไฟล์
        หรือซอฟต์แวร์ที่มีจุดประสงค์มุ่งร้าย
        หรืออาจสร้างความเสียหายต่อระบบหรือข้อมูลในระบบของผู้ใช้งาน อาทิ ไวรัส
        คอมพิวเตอร์เวิร์ม โทรจันฮอร์ส สปายแวร์ หรือไฟล์ซึ่งเป็นอันตรายอื่น ๆ
        (รวมเรียกว่า “ความบกพร่อง”) ทั้งนี้
        ไม่ว่าความบกพร่องดังกล่าวจะเกิดขึ้นจากบุคคล หรือความขัดข้องทางเทคนิค
        หรือเหตุสุดวิสัยอย่างอื่น ดังนั้น
        ผู้ใช้งานจึงรับทราบเงื่อนไขดังกล่าวและตกลงว่าในกรณีที่มีความบกพร่องใด ๆ
        เกิดขึ้น ออนไลน์ แอสเซ็ทจะไม่รับผิดชอบในความสูญหาย ความเสียหาย
        ค่าสินไหมทดแทน ค่าใช้จ่าย หรือค่าเสียหายใด ๆ
        ที่เกิดจากหรือเป็นผลสืบเนื่องมาจากความบกพร่องเหล่านั้นในทุกกรณี 2.4
        ออนไลน์
        แอสเซ็ทสงวนสิทธิ์ในการพิจารณาไม่อนุญาตให้ผู้ใช้งานใช้งานเว็บไซต์นี้
        รวมถึงสงวนสิทธิ์ในการเปลี่ยนแปลง
        หรือระงับการให้บริการเว็บไซต์ไม่ว่าบางส่วนหรือทั้งหมดและไม่ว่าในเวลาใด ๆ
        แก่ผู้ใช้งาน
        โดยไม่จำเป็นต้องบอกกล่าวล่วงหน้าหรือระบุเหตุผลในการดำเนินการนั้น 2.5
        บรรดาข้อมูลรายละเอียด บทความ หรือข้อมูลใด ๆ ที่เผยแพร่ในเว็บไซต์นี้
        เป็นลิขสิทธิ์ของผู้เขียนแต่ละท่าน ซึ่งออนไลน์
        แอสเซ็ทได้รับความอนุเคราะห์ให้นำมาเผยแพร่เพื่อเป็นประโยชน์แก่ประชาชนและนักลงทุนทั่วไป
        สำหรับเนื้อหา ลิงก์เชื่อมโยง รูปภาพ หรือเรื่องอื่นใด ตลอดจนข้อคิดเห็น
        หรือทรรศนะที่อยู่ในบทความซึ่งเผยแพร่อยู่ในเว็บไซต์นี้เป็นความคิดเห็นหรือทรรศนะส่วนบุคคลของผู้เขียนแต่ละท่าน
        และไม่ได้เกี่ยวข้องกับออนไลน์ แอสเซ็ท หรือแสดงว่าออนไลน์ แอสเซ็ทเห็นพ้อง
        ยอมรับ หรือสนับสนุนความคิดเห็นหรือทรรศนะดังกล่าว
        ผู้ใช้งานควรศึกษาข้อมูลให้รอบคอบและใช้วิจารณญาณประกอบการตัดสินใจ 2.6
        ออนไลน์ แอสเซ็ทไม่อาจรับรองว่าบรรดาโฆษณาที่อยู่บนเว็บไซต์นี้ (ถ้ามี)
        มีความถูกต้อง สมบูรณ์ และปราศจากข้อบกพร่องใด ๆ โดยออนไลน์
        แอสเซ็ทเป็นเพียงสื่อกลางในการส่งผ่านข้อมูลการโฆษณาเท่านั้น
        และไม่ใช่ตัวแทน หุ้นส่วน หรือมีนิติสัมพันธ์ใด ๆ
        กับเจ้าของโฆษณาซึ่งปรากฏอยู่บนเว็บไซต์นี้ ไม่สามารถตรวจสอบ
        หรือทราบถึงแหล่งที่มาและ/หรือรายละเอียดของโฆษณาทั้งหมดที่ปรากฏในเว็บไซต์นี้ได้
        ทั้งนี้
        หากการนำเสนอโฆษณาดังกล่าวก่อให้เกิดความสูญหายหรือความเสียหายแก่ผู้ใช้งาน
        ออนไลน์ แอสเซ็ทปฏิเสธความรับผิดและภาระผูกพันทางกฎหมายทุกกรณี 2.7
        นอกเหนือจากที่กำหนดไว้ในข้อตกลงและเงื่อนไขการใช้นี้ ออนไลน์ แอสเซ็ท
        กรรมการ ผู้จัดการ ผู้บริหาร พนักงาน ลูกจ้าง ตัวแทน
        หรือที่ปรึกษาของออนไลน์ แอสเซ็ท จะไม่รับผิดในความผิดพลาด
        หรือความบกพร่องใด ๆ ของเว็บไซต์ หรือจากข้อมูล เนื้อหาที่ปรากฏในเว็บไซต์
        ตลอดจนไม่รับผิดในผลของการละเว้นการกระทำใด ๆ ที่เกี่ยวข้องกับเว็บไซต์นี้
        ไม่ว่าจะเกิดจากสัญญา ละเมิด ประมาท หรือเหตุอื่นใดที่อาจจะเกิดขึ้น
        ถึงแม้ว่าออนไลน์
        แอสเซ็ทจะได้รับแจ้งว่าอาจจะเกิดความเสียหายดังกล่าวขึ้นได้ก็ตาม 3.
        การเชื่อมโยงเว็บไซต์ 3.1 การเชื่อมโยงไปยังเว็บไซต์ของบุคคลอื่น
        เว็บไซต์นี้มีการเชื่อมโยงกับเว็บไซต์อื่น ๆ (“เว็บไซต์ที่เชื่อมโยง”)
        การเชื่อมโยงนี้เพื่ออำนวยความสะดวกแก่ผู้ใช้งานเท่านั้น
        โดยเว็บไซต์ที่เชื่อมโยงนี้มิได้แสดงว่าได้รับการสนับสนุน
        หรืออยู่ภายใต้การควบคุม หรือความรับผิดชอบของออนไลน์ แอสเซ็ท ดังนั้น
        ออนไลน์ แอสเซ็ทจึงไม่อาจให้การรับรองในความถูกต้อง ความน่าเชื่อถือ
        หรือความปลอดภัยของเว็บไซต์ที่เชื่อมโยง
        และจะไม่มีความรับผิดในความสูญหายหรือเสียหายใด ๆ
        ที่ผู้ใช้งานได้รับจากการใช้งานหรือเชื่อมโยงเว็บไซต์ดังกล่าว
        และขอให้ผู้ใช้งานโปรดศึกษาข้อตกลงและเงื่อนไขการใช้งานของเว็บไซต์ที่เชื่อมโยงนั้น
        3.2 การเชื่อมโยงมายังเว็บไซต์ของออนไลน์ แอสเซ็ท ออนไลน์
        แอสเซ็ทยินดีที่จะให้มีการเชื่อมโยงเว็บไซต์ของออนไลน์ แอสเซ็ท
        หากผู้ใช้งานประสงค์ที่จะเชื่อมโยงกับเว็บไซต์ของออนไลน์ แอสเซ็ท ทั้งนี้
        การเชื่อมโยงดังกล่าวจะต้องอยู่ภายใต้เงื่อนไขที่กำหนด ดังต่อไปนี้ (1)
        การเชื่อมโยงนี้ต้องทำในรูปข้อความเท่านั้นโดยแสดงข้อความดังนี้
        “สำนักข่าวอีไฟแนนซ์ไทย” (2) การเชื่อมโยงนี้ต้องเชื่อมโยงไปยัง
        www.efinancethai.com (3) การปรากฏ ตำแหน่ง หรือลักษณะใด ๆ
        ของการเชื่อมโยงนี้ต้องไม่ทำให้เกิดความเสียหายหรือทำให้ความนิยมของชื่อออนไลน์
        แอสเซ็ท และเครื่องหมายการค้าของออนไลน์ แอสเซ็ทลดน้อยลง (4) การปรากฏ
        ตำแหน่ง หรือลักษณะใด ๆ
        ของการเชื่อมโยงนี้ต้องไม่สร้างความเข้าใจที่ว่าองค์กรนั้นมีความเกี่ยวข้องกับออนไลน์
        แอสเซ็ท หรือได้รับการสนับสนุนจากออนไลน์ แอสเซ็ท (5)
        การเชื่อมโยงต้องแสดงหน้าจอเต็มของออนไลน์ แอสเซ็ท และไม่แสดงใน “กรอบ”
        ของเว็บไซต์ที่เชื่อมโยง (6) การเชื่อมโยงต้องไม่สื่อให้เข้าใจว่า ออนไลน์
        แอสเซ็ทสนับสนุนเว็บไซต์หรือมีความร่วมมือใด ๆ ระหว่างออนไลน์
        แอสเซ็ทและผู้ใช้งานหรือองค์กร (7)
        การเชื่อมโยงต้องไม่เข้าลักษณะเป็นการดำเนินการที่ไม่เหมาะสม
        หรืออาจนำมาสู่ความเสียหาย การละเมิด การกระทำที่หยาบคาย หรือหัวข้อ
        ข้อมูลใด ๆ ที่ผิดกฎหมาย หรือเป็นการละเมิดสิทธิในทรัพย์สินทางปัญญา
        ความเป็นเจ้าของ ความเป็นส่วนตัว หรือชื่อเสียงของออนไลน์ แอสเซ็ท (8)
        ออนไลน์ แอสเซ็ทไม่มีความรับผิดในความสูญหายหรือความเสียหายใด ๆ
        ที่เกิดขึ้นแก่ผู้ใช้เว็บไซต์หรือแก่บุคคลภายนอกที่เกิดขึ้นจากผลของการเชื่อมโยงนี้
        อย่างไรก็ดี ออนไลน์
        แอสเซ็ทขอสงวนสิทธิ์ที่จะได้รับการเยียวยาที่มีขึ้นโดยกฎหมายในกรณีที่มีการผิดข้อตกลงนี้
        (9) ไม่ว่าเวลาใด ๆ ออนไลน์
        แอสเซ็ทสงวนสิทธิ์ในการยกเลิกความยินยอมให้มีการเชื่อมโยงเนื้อหาหรือหน้าเว็บไซต์นี้
        และสงวนสิทธิในการยกเลิกการเชื่อมโยงใด ๆ โดยอยู่ในดุลพินิจของออนไลน์
        แอสเซ็ทแต่เพียงผู้เดียว 4. ข้อตกลงการใช้งานเฉพาะส่วน 4.1
        ข้อตกลงการใช้บริการ RSS ผู้ใช้งานตกลงที่จะปฏิบัติตามข้อตกลงการใช้บริการ
        RSS จากเว็บไซต์ของออนไลน์ แอสเซ็ท ดังนี้ 4.1.1 บริการ RSS
        จากเว็บไซต์ของออนไลน์ แอสเซ็ท (“บริการ RSS”)
        เป็นบริการนำเสนอข่าวหรือบทความจากเว็บไซต์ของออนไลน์ แอสเซ็ท
        www.efinancethai.com ในรูปแบบมาตรฐาน XML โดยจะนำส่ง “หัวข้อข่าว” และ
        “เส้นทางเชื่อมโยงถึงหน้าเว็บไซต์ของออนไลน์ แอสเซ็ท” 4.1.2 บริการ RSS
        เป็นบริการฟรี ไม่มีค่าใช้จ่าย
        เพื่อการใช้งานส่วนตัวและการใช้งานที่มิใช่เพื่อผลประโยชน์ทางการค้า
        ผู้ใช้งานไม่แก้ไขหรือเปลี่ยนแปลงส่วนใด ๆ ของข้อความหรือการเชื่อมโยง
        และการใช้บริการ RSS
        ต้องเชื่อมโยงตรงไปที่หน้าเว็บไซต์โดยต้องแสดงหน้าจอเต็มของเว็บไซต์ของออนไลน์
        แอสเซ็ท และต้องไม่จัดทำหรือเพิ่มหน้าเว็บไซต์
        รูปภาพหรือโปรแกรมคอมพิวเตอร์ใด ๆ ระหว่างทางของการเชื่อมโยง RSS
        และหน้าเว็บไซต์ของออนไลน์ แอสเซ็ท 4.1.3 การใช้บริการ RSS
        บนเว็บไซต์ของผู้ใช้งาน ต้องแสดงข้อความเป็นตัวอักษร
        “www.efinancethai.com” กำกับการใช้บริการ RSS ของออนไลน์ แอสเซ็ท 4.1.4
        ออนไลน์ แอสเซ็ทไม่อนุญาตการใช้บริการ RSS นอกเหนือจากที่ได้ระบุไว้ 4.1.5
        ออนไลน์ แอสเซ็ทสงวนสิทธิ์ในการเปลี่ยนแปลงหรือระงับการให้บริการ RSS
        บางส่วนหรือทั้งหมดไม่ว่าในเวลาใด ๆ
        และผู้ใช้งานจะต้องหยุดดำเนินการที่เกี่ยวกับบริการ RSS ในทุกกรณี ทั้งนี้
        ออนไลน์ แอสเซ็ทเป็นเจ้าของลิขสิทธิ์ในเนื้อหา ภาพ เครื่องหมายของออนไลน์
        แอสเซ็ท ซึ่งปรากฏบนบริการ RSS แต่เพียงผู้เดียว 5.
        นโยบายคุ้มครองข้อมูลส่วนบุคคล (Privacy Policy)
        ข้อมูลส่วนบุคคลของผู้ใช้งานสำหรับการใช้งานเว็บไซต์นี้ เช่น
        ข้อมูลที่ผู้ใช้งานลงทะเบียน ข้อมูลการใช้งานเว็บไซต์ของผู้ใช้งาน
        และ/หรือข้อมูลอื่นใดของผู้ใช้งาน
        ได้รับความคุ้มครองภายใต้นโยบายคุ้มครองข้อมูลส่วนบุคคล (Privacy Policy)
        โดยผู้ใช้งานสามารถศึกษาข้อมูลเพิ่มเติมได้จาก Privacy Policy 6.
        นโยบายการรักษาความมั่นคงปลอดภัยของเว็บไซต์ ออนไลน์
        แอสเซ็ทได้เลือกใช้เทคโนโลยี
        มาตรการรักษาความมั่นคงปลอดภัยในการทำธุรกรรมบนเครือข่ายอินเทอร์เน็ต
        เพื่อป้องกันข้อมูลของผู้ใช้งานในระหว่างการส่งข้อมูลผ่านเครือข่ายการสื่อสาร
        หรือจากการถูกโจรกรรมข้อมูลโดยบุคคลหรือเครือข่ายอื่นทุกระบบที่ไม่ได้รับอนุญาตเข้ามาเชื่อมต่อกับเครือข่ายของออนไลน์
        แอสเซ็ท เช่น Firewall และการเข้ารหัสแบบ Secured Socket Layer (SSL)
        เป็นต้น 7. รหัสประจำตัว (User ID) และรหัสผ่าน (Password) 7.1
        ในการใช้งานเว็บไซต์ด้วยการเข้าสู่ระบบ (Login) สมาชิก efin Member
        ผู้ใช้งานจะต้องมีรหัสประจำตัว (Username) และรหัสผ่าน (Password) ของตนเอง
        โดยผู้ใช้งานจะต้องเก็บรักษารหัสประจำตัวและรหัสผ่านของตนเองไว้เป็นความลับ
        การเข้าใช้งานและทำรายการใด ๆ ที่เกิดขึ้นจากการ Login
        ผ่านรหัสประจำตัวและรหัสผ่านของผู้ใช้งานในเว็บไซต์นี้ให้ถือว่าการกระทำดังกล่าวถูกต้องสมบูรณ์และเป็นการกระทำของผู้ใช้งานเอง
        หากมีความเสียหายใด ๆ เกิดขึ้น ไม่ว่าจะด้วยเหตุใดก็ตาม
        ผู้ใช้งานจะต้องรับผิดชอบในการกระทำดังกล่าวทุกประการ
        และผู้ใช้งานตกลงจะไม่โต้แย้งหรือเรียกร้องให้ออนไลน์
        แอสเซ็ทรับผิดชอบชดใช้ค่าเสียหายแทนผู้ใช้งานทุกกรณี 7.2
        ผู้ใช้งานสามารถเปลี่ยนแปลง ระงับ หรือยกเลิกรหัสประจำตัวและรหัสผ่าน
        และ/หรือการใช้งานเว็บไซต์นี้ได้ตลอดเวลาด้วยตนเอง โดยแจ้งมายังออนไลน์
        แอสเซ็ทผ่านทาง efin Customer Support: customerservice@efinanceThai.com
        02-022 -6200 ทั้งนี้ ออนไลน์ แอสเซ็ทจะไม่รับผิดชอบในความเสียหายใด ๆ
        ที่เกิดขึ้นก่อนกระบวนการระงับหรือยกเลิกดังกล่าวมีผลสมบูรณ์ 8.
        การละเมิดข้อตกลงและเงื่อนไขการใช้
        ในกรณีที่มีการละเมิดข้อตกลงและเงื่อนไขการใช้งานเว็บไซต์ ออนไลน์
        แอสเซ็ทสงวนสิทธิ์ที่จะระงับการเข้าถึงหรือยกเลิกการให้บริการใด ๆ
        ที่มีขึ้นบนเว็บไซต์นี้ ทั้งนี้
        การระงับหรือยกเลิกดังกล่าวไม่ถือเป็นการตัดสิทธิออนไลน์
        แอสเซ็ทที่จะได้รับการเยียวยาตามข้อตกลงและเงื่อนไขการใช้นี้
        รวมถึงสิทธิอื่นใดตามกฎหมายที่เกี่ยวข้อง 9. กฎหมายที่บังคับใช้
        ข้อตกลงและเงื่อนไขการการใช้งานเว็บไซต์นี้อยู่ภายใต้บังคับแห่งกฎหมายไทย
      </div>
      <footer className="sticky bottom-0 flex flex-col items-center justify-center gap-5 pt-5 pb-12 bg-white">
        <Checkbox
          className="ant-checkbox__custom ant-checkbox__blue"
          onChange={onChange}
          disabled={!isScrolledToBottom}
        >
          ยอมรับข้อตกลง *
        </Checkbox>
        <Button
          type="primary"
          className="ant-btn__custom ant-btn__custom-blue !rounded-full w-[200px]"
          onClick={handleRegisterClick}
          disabled={!isChecked}
        >
          ยืนยัน
        </Button>
      </footer>
    </div>
  );
}
